tutorials/eulerianFilteredTFM/sideInjection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.01)
    (0.305 0 -0.01)
    (0.305 16.79 -0.01)
    (0 16.79 -0.01)
    (0 0 0.01)
    (0.305 0 0.01)
    (0.305 16.79 0.01)
    (0 16.79 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 400 1) simpleGrading (1 1 1) //WARNING: should have at least 10 cells in x-direction!
);

edges
(
);

patches
(
    patch inlet.air
    (
        (1 5 4 0)
    )

    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
        (3 7 6 2)
    )
    empty frontAndBackPlanes
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
